Revit 2026 API
RebarShapeVertex Methods
The RebarShapeVertex type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetConstraints |  Retrieve the list of constraints associated with this vertex.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetConstraints
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace